<a href="https://colab.research.google.com/github/abhidhawale/MachineLearningProjects/blob/master/EDA_Preprocessing_StudentPerformance.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

##EDA-Preprocessing
###Read the given Students Performance.csv perform following operations:
i) Print head, tail, and shape.

ii) Change the male column to integer 0 and Change female column to integer 1 using loc function.

iii) Count the total no of values from columns gender, race/ethnicity, parental level of education,lunch using value_counts ().

iii) Print statistical info.

Importing necessary packages

In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

###Reading .csv dataset
Displaying the first 5 rows of the dataframe

In [ ]:
df = pd.read_csv('/content/dataset-23-1-StudentsPerformance.csv')

df.head()

   gender race/ethnicity  ... reading score writing score
0  female        group B  ...            72            74
1  female        group C  ...            90            88
2  female        group B  ...            95            93
3    male        group A  ...            57            44
4    male        group C  ...            78            75

[5 rows x 8 columns]

Displaying the last 5 rows of the dataframe

In [ ]:
df.tail()

     gender race/ethnicity  ... reading score writing score
995  female        group E  ...            99            95
996    male        group C  ...            55            55
997  female        group C  ...            71            65
998  female        group D  ...            78            77
999  female        group D  ...            86            86

[5 rows x 8 columns]

Displaying the dimensions of the dataframe

In [ ]:
df.shape

(1000, 8)

###Changing categorical variables to numerical values

In [ ]:
df.loc[df["gender"] == "female", "gender"] = 1
df.loc[df["gender"] == "male", "gender"] = 0
df.head()

  gender race/ethnicity  ... reading score writing score
0      1        group B  ...            72            74
1      1        group C  ...            90            88
2      1        group B  ...            95            93
3      0        group A  ...            57            44
4      0        group C  ...            78            75

[5 rows x 8 columns]

Counting the no. of entries for "Gender" column

In [ ]:
df['gender'].value_counts()

1    518
0    482
Name: gender, dtype: int64

Counting the no. of entries for "Race/ethnicity"  column

In [ ]:
df['race/ethnicity'].value_counts()

group C    319
group D    262
group B    190
group E    140
group A     89
Name: race/ethnicity, dtype: int64

In [ ]:
df['parental level of education'].value_counts()

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

In [ ]:
df['lunch'].value_counts()

standard        645
free/reduced    355
Name: lunch, dtype: int64

###Statistical description of the dataframe

In [ ]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000